Revit 2026 API

# MEPNetworkIteratorStart Method

---

Gets the first step of network iteration.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Start()
```
```vb
Public Sub Start
```
```cpp
public:
void Start()
```
```fsharp
member Start : unit -> unit
```

The first step may not contain any analytical segment, but the first analytical node.

#### Reference

MEPNetworkIterator Class

Autodesk.Revit.DB.Analysis Namespace